documentation/Documentation-for-xslt-import.org
#+TITLE: Documentation for XML import into MenotaB using XSLT
#+AUTHOR: Beeke Stegmann 
#+OPTIONS: toc:t
#+LANGUAGE: english
#+LATEX_HEADER: \cohead{{\scshape Documentation for XML import into MenotaB using XSLT}}
#  #+DATE: \today{}
** General information
This is the documentation for the XML import into MenotaB using one XSLT
stylesheet (=XML-to-MenotaB-transform.xsl=), which, when run on an XML
file, produces text output in the format that is expected by MenotaB.

The XSLT works both on pure TEI P5 XML and Menotic XML according to
Menota Handbook v.2 and v.3. 
Please note, however, that the Menotic elements <me:textSpan>, <me:all> 
and <me:ass> are currently not processed by the stylesheet.

It expects the most common XML elements and attributes. Special elements
or variant forms of encoding which might validate but are not
recommended by the standards (such as non-standardized attribute values)
might not be taken into consideration.
The stylesheet expects all words to be wrabbed in =<w>= elements
and also requires =<pb>= abd =<lb>= element with =@n= attributes
to mark the page and line breaks in the artefact being transcribed.

The XSLT only works on a valid XML file that is validated against the
TEI-namespace (and optionally also the Menota namespace). In other
words, the =<TEI>= element is expected as the outermost element and it
needs to have the attribute @xmlns="[[http://www.tei-c.org/ns/1.0]]".
For Menotic XML, the namespace @xmlns:me="[[http://menota.org/ns/1.0]]"
can be added.

The XSLT produces output in pure text format which can be understood by
org-mode.

** Document structure
The output document follows the org-mode syntax and includes some raw
XML-code. First, a line for the internal identifier (i.e. text number)
is produced, but since the XSLT cannot automatically assign this number 
from a sinlge XML-imput file, the output currently produces two asterisks
followed by "(TEXT-NUMBER)".


Second, one line with 17 fields (separated by pipe characters)
containing meta information is addet to the output document.

 - This line is identified by =:m:= in the first field.
 - The second field is reserved for the text number, i.e. a running number 
   within a given corpus, which might be project specific.
 - The third field gives the identifier of the artefact in question
   (i.e. either the shelfmark or any other ID specified in
   =<msIdentifier>= or, if not encoded, the contents of =<titleStmt>=).
 - The fourth field gives the date, if present from =<origDate>=, if not
   from a potentially present =<date>= element in =<origin>=.

*[:TODO: The following fields have not yet been assigned. Check! Which other*
*info to include?] Det er endnu lidt uafklaret hvilken type meta-information vi*
*ender med. Her må vi regne med at at der vil ske ændringer.]*

Third, the output file has a section for notes (three asterisks), with
subsections for the XML header and potentially information on facsimile mapping,
the front and/or back matter. All XML files are expected to have a
=<teiHeader>=, but the other subsections are only produced in cases where
=<facsimile>=, =<front>= and =<back>=, respectively, are present. All
subsections simply copy over the XML from the input file and print the code
within an XML source code block.[fn:: Currently the transformation adds some
unnecessary attributes here if the Menota schema is used.]

Fourth, the output file gives the transcription (three asterisks) in
MenotaB format: Each line has 17 fields (separated by pipe characters)
that are allocated to slightly varying values or types of information
depending on the nature of the encoded element (e.g. if it is a word,
punctuation character etc.). The different elements, their expected
XML-encoding, and how the values and attributes are converted and
represented in the 17 fields of each line in the output are described
below. The transcription (expected to be found inside =<body>= as a
child of =<text>=) is processed and returned inside enclosing lines with
=:s:= and =:e:= for "start" end "end".


