documentation/Documentation-for-xslt-import.html
<!doctype html>
<html lang="english">
<head>
<title>Documentation for XML import into MenotaB using XSLT</title>
<!-- 2018-03-05 Mon 11:38 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Beeke Stegmann">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Documentation for XML import into MenotaB using XSLT</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> General information</h2>
<div class="outline-text-2" id="text-1">
<p>
This is the documentation for the XML import into MenotaB using one XSLT
stylesheet (<code>XML-to-MenotaB-transform.xsl</code>), which, when run on an XML
file, produces text output in the format that is expected by MenotaB.
</p>

<p>
The XSLT works both on pure TEI P5 XML and Menotic XML according to
Menota Handbook v.2 and v.3. 
Please note, however, that the Menotic elements &lt;me:textSpan&gt;, &lt;me:all&gt; 
and &lt;me:ass&gt; are currently not processed by the stylesheet.
</p>

<p>
It expects the most common XML elements and attributes. Special elements
or variant forms of encoding which might validate but are not
recommended by the standards (such as non-standardized attribute values)
might not be taken into consideration.
The stylesheet expects all words to be wrabbed in <code>&lt;w&gt;</code> elements
and also requires <code>&lt;pb&gt;</code> abd <code>&lt;lb&gt;</code> element with <code>@n</code> attributes
to mark the page and line breaks in the artefact being transcribed.
</p>

<p>
The XSLT only works on a valid XML file that is validated against the
TEI-namespace (and optionally also the Menota namespace). In other
words, the <code>&lt;TEI&gt;</code> element is expected as the outermost element and it
needs to have the attribute @xmlns="<a href="http://www.tei-c.org/ns/1.0">http://www.tei-c.org/ns/1.0</a>".
For Menotic XML, the namespace @xmlns:me="<a href="http://menota.org/ns/1.0">http://menota.org/ns/1.0</a>"
can be added.
</p>

<p>
The XSLT produces output in pure text format which can be understood by
org-mode.
</p>

<p>
ASK: Midlertidig tilføjelse
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Document structure</h2>
<div class="outline-text-2" id="text-2">
<p>
The output document follows the org-mode syntax and includes some raw
XML-code. First, a line for the internal identifier (i.e. text number)
is produced, but since the XSLT cannot automatically assign this number 
from a sinlge XML-imput file, the output currently produces two asterisks
followed by "(TEXT-NUMBER)".
</p>


<p>
Second, one line with 17 fields (separated by pipe characters)
containing meta information is addet to the output document.
</p>

<ul class="org-ul">
<li>This line is identified by <code>:m:</code> in the first field.
</li>
<li>The second field is reserved for the text number, i.e. a running number 
within a given corpus, which might be project specific.
</li>
<li>The third field gives the identifier of the artefact in question
(i.e. either the shelfmark or any other ID specified in
<code>&lt;msIdentifier&gt;</code> or, if not encoded, the contents of <code>&lt;titleStmt&gt;</code>).
</li>
<li>The fourth field gives the date, if present from <code>&lt;origDate&gt;</code>, if not
from a potentially present <code>&lt;date&gt;</code> element in <code>&lt;origin&gt;</code>.
</li>
</ul>

<p>
<b>[:TODO: The following fields have not yet been assigned. Check! Which other</b>
<b>info to include?] Det er endnu lidt uafklaret hvilken type meta-information vi</b>
<b>ender med. Her må vi regne med at at der vil ske ændringer.]</b>
</p>

<p>
Third, the output file has a section for notes (three asterisks), with
subsections for the XML header and potentially information on facsimile mapping,
the front and/or back matter. All XML files are expected to have a
<code>&lt;teiHeader&gt;</code>, but the other subsections are only produced in cases where
<code>&lt;facsimile&gt;</code>, <code>&lt;front&gt;</code> and <code>&lt;back&gt;</code>, respectively, are present. All
subsections simply copy over the XML from the input file and print the code
within an XML source code block.<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>

<p>
Fourth, the output file gives the transcription (three asterisks) in
MenotaB format: Each line has 17 fields (separated by pipe characters)
that are allocated to slightly varying values or types of information
depending on the nature of the encoded element (e.g. if it is a word,
punctuation character etc.). The different elements, their expected
XML-encoding, and how the values and attributes are converted and
represented in the 17 fields of each line in the output are described
below. The transcription (expected to be found inside <code>&lt;body&gt;</code> as a
child of <code>&lt;text&gt;</code>) is processed and returned inside enclosing lines with
<code>:s:</code> and <code>:e:</code> for "start" end "end".
</p>
</div>
