documentation/Documentation-for-xslt-import.org
*** Regular words, punctuation characters and numbers
In general, words that are encoded using =<w>= in the XML file are
imported in the following way (a = Menotic XML; b = TEI P5; c = a
fictive example with even more information, output only). Please note:
For words with additional markup for e.g. emendations or defects
additional rules may apply; see further below. Punctuation characters
(encoded either as =<pc>= or =<me:punct>=) and numbers (encoded as
=<num>=) are treated in the same way as words (as far as applicable).

#+CAPTION: (a)
#+BEGIN_SRC xml
    <w me:msa="xVB fF tPT mIN p3 nS vA iST" lemma="gefa">
        <choice>
            <me:facs>gaꝼ</me:facs>
            <me:dipl>gaf</me:dipl>
            <me:norm>gaf</me:norm>
        </choice>
    </w>
#+END_SRC

#+BEGIN_SRC orgmode
    | type | lemma1 | lemma2 | msa                         | norm1 | norm2 | dipl | facs | word/image nummer | palaeogr. annot. | graphophon. annot. | notes | language | extra1 | extra2 | spacing? | position in source |
    | w    |        | gefa   | xVB fF tPT mIN p3 nS vA iST |       | gaf   | gaf  | gaꝼ  |            000001 |                  |                    |       |          |        |        |          | 168r-01            |
#+END_SRC


#+CAPTION: (b)
#+BEGIN_SRC xml
    <w n="14" lemma="menneske" type="sb">
        <choice>
            <reg>mennesken</reg>
            <orig>me<choice><am>̅</am><ex>n</ex></choice>níſken</orig>
        </choice>
    </w>
#+END_SRC

#+BEGIN_SRC orgmode
    | type | lemma1 | lemma2   | msa | norm1 | norm2    | dipl        | facs     | word/image nummer | palaeogr. annot. | grapho-phon. annot. | notes | language | extra1 | extra2 | spacing? | position in source |
    | w    |        | menneske | sb  |       | menneske | me(n)níſken | men̅íſken |            000023 |                  |                     |       |          |        |        |          | 023ra-10           |
#+END_SRC


#+CAPTION: (c)
#+BEGIN_SRC orgmode
    | type | lemma1 | lemma2 | msa          | norm1         | norm2     | dipl  | facs | word/image nummer | palaeogr. annot. | grapho-phon. annot. | notes | language | extra1 | extra2 | spacing? | position in source |
    | w    | ég     | vér    | xPE p1 nP cN | vér           | vér       | W(ær) | W͛   |            000001 |                  | {W:v}{͛:[ér,ǽr]}    |       | oic      |        |        | =        |            168-01  |
#+END_SRC

In both cases, the first field (= type) takes the value =w= for "word".
The only exception is when the =<w>= in question is encoded as a
descendant of =<gap>=, in which case the entire word is assumed to be
lost and the value =L= is printed instead. For punctuation characters
the first field takes =p=; for numbers =n=.

The second and third field are for lemma1 and lemma2, which are read
from @lemma on =<w>= or =<num>= if encoded (and if present
@me:orig-lemma). If only one lemma is present, it is assumed to be
@lemma (as is the case in both a and b), and its value is read into the
third field (= lemma2), while the second field is left empty. If an
additional lemma is encoded, i.e. @me:org-lemma, its value is read into
the second field (= lemma1) as can be seen in example (c). If there are
any homonymous lemmata encoded in any of the two attributes (using a
pipe character as a separator), that character is replaced by a broken
bar.

The fourth field (= msa) is populated with the morphosyntactic
annotation if present. If encoded, the value of the attribute @me:msa is
imported. Otherwise, the value of a potentially present attribute @type
is read in. If none of these are encoded, the field is left empty.

The fifth and sixth field (= norm1 and norm2) contain the normalized
form(s) of the word. If only one normalized form is present, it is
imported into the sixth field (= norm2). A second or alternative
normalized form may be placed in the fifth field (= norm1). For Menotic
XML (a), the value is taken from the element =<me:norm>=, for TEI P5 XML
(b) it is taken from =<reg>=. All descending elements of =<me:norm>= or
<reg> are processed (see below). If the word in question is marked up as
a descendant of =<unclear>=, =<supplied>=, =<add>=, =<del>=, =<sic>=,
=<corr>= or =<surplus>= / =<me:suppressed>= (or =<me:expunged>=) the
relevant editorial markup is automatically inserted around the word
form. The characters used are the same as for changes or emendations
within a word (see below).

The seventh field (= dipl) is populated with the diplomatic word form.
In Menotic XML (a) it is read from the element =<me:dipl>=, in TEI P5
XML (b) from =<orig>= with the contents of all descendant =<ex>=
elements (displayed in parentheses), while the contents of =<am>= is
suppressed. All other descending elements of =<orig>= and =<me:dipl>=
are processed as normal. If the word in question is marked up as a
descendant of =<unclear>=, =<supplied>=, =<add>=, =<del>=, =<sic>=,
=<corr>= or =<surplus>= / =<me:suppressed>= (or =<me:expunged>=) the
relevant editorial markup is automatically inserted around the word
form. The characters used are the same as for changes or emendations
within a word (see below). If the input contains a single-level
transcription, in which the text is simply transcribed within =<w>=
(i.e. without any =<choice>= and respective child elements, the
transcription is assumed to be on the diplomatic level and therefore
read into the seventh field. In case there are both a =<sic>= and
=<corr>= form encoded for a word in a single-level transcription the
corrected form is printed in the current field (whereas the sic-form is
given in the eighth field).

The eighth field (= facs) is populated with the facsimile word form. In
Menotic XML (a) it is read from the element =<me:facs>=, in TEI P5 XML
(b) from =<orig>= with the contents of all descendant =<am>= elements,
while the contents of =<ex>= is suppressed. All other descending
elements of =<orig>= and =<me:facs>= are processed as normal. If the
word in question is marked up as a descendant of =<unclear>=,
=<supplied>=, =<add>=, =<del>=, =<sic>=, =<corr>= or
=<surplus>= / =<me:suppressed>= (or =<me:expunged>=) the relevant
editorial markup is automatically inserted around the word form. The
characters used are the same as for changes or emendations within a word
(see below).

The ninth field (= word/image nummer) is populated automatically, counting all
=<w>=, =<pc>= (or =<me:punct>=) and =<num>= elements in the =<body>=. The output
is given as a six digit number. If @n is encoded for =<w>= it is not
considered. If the actual order of words in an artefact differs from the
logical order (or the order it should be read in), the reordering of
the words in question is noted in this field by adding additional
numbers in parentheses behind the numbers. Note that the expected format for 
marking up reordered text follows the guidelines of the Menota Handbook v.3 with 
multiple =<lb>= milestones that carry different =@rend= attributes
to indicate the physical rendition of the part of the lines
in question.) The parentheses first print the value of =@rend= of 
the preceding <lb> (if it has one), followed by a hyphen and the 
position of the word or punctuation character within the given part 
of the line. *[fn:: Neither 
of these counts consider words spanning more than one line (e.g. at the end of 
a line) twice, i.e. in terms of images, but rather counts nodes in the XML file.
Later this is fixed by an elisp function which overwrites the erroneous numbers. 
ASK: husk også at ord, der indeholder et =<lb>= med =@rend= ikke får paranteserne
indlagt (fordi funktionen går på hele ord). Disse ord er dog markeret med en særlig
tegnkombination i transskriptionsfelterne, hvor =<lb>= elementet bliver
transformeret til broken pipe character + @rend + værdien af rend + broken pipe
 character i stedet for en enkel broken pipe character. ]*

The tenth field (= paleograph. annot.) reads in palaeogaphic
information. More specifically, it imports the contents of =<me:pal>= if
present. Furthermore, if initials are encoded using =<c>=
or =<hi>=, the values of all potential attributes are read and printed in this field,
separated by broken pipe characters. The contents of =<c>= or =<hi>= is 
reproduced in the fields for the facsimile (and potentially diplomatic)
form of the word according to the XML encoding.
*[Note that in case a hyphen is encoded with =<c>= and =@type= of the value =hyphen= this attribute value as well as potential others,
such as =@resp= are reproduced here.]*

The eleventh field (= grapho-phon. annot.) does at present not read in
anything from the XML input.

The twelfth field (= notes) imports the contents of any =<note>=
elements that might be associated with a =<w>=. Please note that only
=<note>= elements /within/ =<w>= are processed correctly, while
potential =<note>= elements placed immediately following or elsewhere
are not considered.

The thirteenth field (= language) holds the language key for the word.
If any ancestor element (e.g. =<div>=, =<p>=, =<seg>=) has an attribute
@xml:lang, the attribute's value of the closest element with such an
attribute is inserted. Otherwise, the stylesheet checks for the presence
of the element =<langUsage>= in the header and reads out any descendant
elements =<language>= for their respective @ident. If several
=<language>= elements are present, the different values of @ident are
imported and separated by white space.

The fourteenth and fifteenth field (= extra1 and extra2) are additional
fields for project specific information. Currently, the fourteenth field
(= extra1) is used for reading in information on multiple morphemes if
encoded in the XML. The information from the separate =<m>= elements, as
in the example below, is represented by the same number of pairs of
curly brackets that contain a mapping of the contents to the value of
@baseform separated by a colon (see example).


#+CAPTION: Example of XML with =<m>= elements
#+BEGIN_SRC xml
    <w me:msa="xNP gM nS cD sI" lemma="Iðavǫllr">
                                <m baseForm="ið">Iða</m>
                                <m baseForm="vǫllr">vǫllr</m>
                                <choice>
                                    <me:facs>ıða uellı</me:facs>
                                    <me:dipl>iða uelli</me:dipl>
                                    <me:norm>Iðavelli</me:norm>
                                </choice>
                            </w>
#+END_SRC

#+BEGIN_SRC orgmode
    | {ið:Iða}{vǫllr:vǫllr} |
#+END_SRC

In case of an additional attribute =@type= (e.g. with the value of
"prefix", "root" or "suffix"), this value is added at the end, separated
by another colon.

The sixteenth field (= spacing?) holds information on two (or more)
words, numbers or punctuation characters that are written together in
the original. If an element =<seg>= with an attribute =@type= and the
value =nb= or =enc= is present in the transcription enclosing the words
in question, the XSL stylesheet inserts equal signs or not-equal signs, respectively.
For the first word
of the segment either one equal sign or a non-equal sign is printed
 and an additional equal sign/non-equal sign for every following. E.g. if
three words are written together in the original and encoded in the XML
using =<seg>= with =@type= of the value =nb=, the output will show a single equal sign in the
sixteenth field of the first word, two equal signs in the sixteenth
field of the second word, and three equal signs in the respective field
for the third word.
*[Note: The number of equal signs (or non-equal signs) in case of three or more element is to be changed in the elisp handling in such a way that the last element of such a 
sequence always has two equal signs, while the intermediate ones can have more]*

The seventeenth and final field (= position in source) is automatically
populated with the information of both the page/folio and line
information of where the word is located based on the present encoding
of =<pb/>=, =<lb/>= and potentially =<cb/>= and the values of their
respective =@n=. Any markup for page breaks, line breaks or column
breaks found in editions (expected to be marked with @type="ed" or @ed)
are ignored.

For =<pb/>= =@n= is expected to contain a string of up to four
characters, i.e. usually a number of one to three digits
 combined with r or v for
/recto/ or /verso/; for =<lb/>= =@n= is expected to
contain a single number (no letters!) of a maximum of two digits; for
=<cb/>= the value of @n is expected to be a single letter. The output
format is =[0-9][0-9][0-9][rv]-[0-9][0-9]= for folio/page-leaf (e.g.
023r-09). In case the primary source is written in more than one column
and this in encoded in the XML using =<cb/>=, the letter of the column
is added to the end of the folio/page information (e.g. 023ra-07). If a
word is written on more than one line and this fact is encoded with a
=<lb/>= (and potentially also =<pb/>= or =<cb/>=) inside the =<w>= in
question, the seventeenth field also reads in the location of the second
and potentially further parts of the word. The format for the position
is always the same; the multiple elements are separated by an m-dash
(e.g. 123v-09---123v-10).


