documentation/Documentation-for-xslt-import.html


<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Regular words, punctuation characters and numbers</h3>
<div class="outline-text-3" id="text-2-1">
<p>
In general, words that are encoded using <code>&lt;w&gt;</code> in the XML file are
imported in the following way (a = Menotic XML; b = TEI P5; c = a
fictive example with even more information, output only). Please note:
For words with additional markup for e.g. emendations or defects
additional rules may apply; see further below. Punctuation characters
(encoded either as <code>&lt;pc&gt;</code> or <code>&lt;me:punct&gt;</code>) and numbers (encoded as
<code>&lt;num&gt;</code>) are treated in the same way as words (as far as applicable).
</p>

<div class="org-src-container">
<label class="org-src-name">(a)</label>
<pre class="src src-xml">&lt;<span style="color: #edd400; font-weight: bold;">w</span> <span style="color: #729fcf;">me</span>:<span style="color: #ff6347;">msa</span>=<span style="color: #ad7fa8; font-style: italic;">"xVB fF tPT mIN p3 nS vA iST"</span> <span style="color: #ff6347;">lemma</span>=<span style="color: #ad7fa8; font-style: italic;">"gefa"</span>&gt;
    &lt;<span style="color: #edd400; font-weight: bold;">choice</span>&gt;
        &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">facs</span>&gt;ga&#42876;&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">facs</span>&gt;
        &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">dipl</span>&gt;gaf&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">dipl</span>&gt;
        &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">norm</span>&gt;gaf&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">norm</span>&gt;
    &lt;/<span style="color: #edd400; font-weight: bold;">choice</span>&gt;
&lt;/<span style="color: #edd400; font-weight: bold;">w</span>&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-orgmode">| type | lemma1 | lemma2 | msa                         | norm1 | norm2 | dipl | facs | word/image nummer | palaeogr. annot. | graphophon. annot. | notes | language | extra1 | extra2 | spacing? | position in source |
| w    |        | gefa   | xVB fF tPT mIN p3 nS vA iST |       | gaf   | gaf  | gaꝼ  |            000001 |                  |                    |       |          |        |        |          | 168r-01            |
</pre>
</div>


<div class="org-src-container">
<label class="org-src-name">(b)</label>
<pre class="src src-xml">&lt;<span style="color: #edd400; font-weight: bold;">w</span> <span style="color: #ff6347;">n</span>=<span style="color: #ad7fa8; font-style: italic;">"14"</span> <span style="color: #ff6347;">lemma</span>=<span style="color: #ad7fa8; font-style: italic;">"menneske"</span> <span style="color: #ff6347;">type</span>=<span style="color: #ad7fa8; font-style: italic;">"sb"</span>&gt;
    &lt;<span style="color: #edd400; font-weight: bold;">choice</span>&gt;
        &lt;<span style="color: #edd400; font-weight: bold;">reg</span>&gt;mennesken&lt;/<span style="color: #edd400; font-weight: bold;">reg</span>&gt;
        &lt;<span style="color: #edd400; font-weight: bold;">orig</span>&gt;me&lt;<span style="color: #edd400; font-weight: bold;">choice</span>&gt;&lt;<span style="color: #edd400; font-weight: bold;">am</span>&gt;&#773;&lt;/<span style="color: #edd400; font-weight: bold;">am</span>&gt;&lt;<span style="color: #edd400; font-weight: bold;">ex</span>&gt;n&lt;/<span style="color: #edd400; font-weight: bold;">ex</span>&gt;&lt;/<span style="color: #edd400; font-weight: bold;">choice</span>&gt;n&#237;&#383;ken&lt;/<span style="color: #edd400; font-weight: bold;">orig</span>&gt;
    &lt;/<span style="color: #edd400; font-weight: bold;">choice</span>&gt;
&lt;/<span style="color: #edd400; font-weight: bold;">w</span>&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-orgmode">| type | lemma1 | lemma2   | msa | norm1 | norm2    | dipl        | facs     | word/image nummer | palaeogr. annot. | grapho-phon. annot. | notes | language | extra1 | extra2 | spacing? | position in source |
| w    |        | menneske | sb  |       | menneske | me(n)níſken | men̅íſken |            000023 |                  |                     |       |          |        |        |          | 023ra-10           |
</pre>
</div>


<div class="org-src-container">
<label class="org-src-name">(c)</label>
<pre class="src src-orgmode">| type | lemma1 | lemma2 | msa          | norm1         | norm2     | dipl  | facs | word/image nummer | palaeogr. annot. | grapho-phon. annot. | notes | language | extra1 | extra2 | spacing? | position in source |
| w    | ég     | vér    | xPE p1 nP cN | vér           | vér       | W(ær) | W͛   |            000001 |                  | {W:v}{͛:[ér,ǽr]}    |       | oic      |        |        | =        |            168-01  |
</pre>
</div>

<p>
In both cases, the first field (= type) takes the value <code>w</code> for "word".
The only exception is when the <code>&lt;w&gt;</code> in question is encoded as a
descendant of <code>&lt;gap&gt;</code>, in which case the entire word is assumed to be
lost and the value <code>L</code> is printed instead. For punctuation characters
the first field takes <code>p</code>; for numbers <code>n</code>.
</p>

<p>
The second and third field are for lemma1 and lemma2, which are read
from @lemma on <code>&lt;w&gt;</code> or <code>&lt;num&gt;</code> if encoded (and if present
@me:orig-lemma). If only one lemma is present, it is assumed to be
@lemma (as is the case in both a and b), and its value is read into the
third field (= lemma2), while the second field is left empty. If an
additional lemma is encoded, i.e. @me:org-lemma, its value is read into
the second field (= lemma1) as can be seen in example (c). If there are
any homonymous lemmata encoded in any of the two attributes (using a
pipe character as a separator), that character is replaced by a broken
bar.
</p>

<p>
The fourth field (= msa) is populated with the morphosyntactic
annotation if present. If encoded, the value of the attribute @me:msa is
imported. Otherwise, the value of a potentially present attribute @type
is read in. If none of these are encoded, the field is left empty.
</p>

<p>
The fifth and sixth field (= norm1 and norm2) contain the normalized
form(s) of the word. If only one normalized form is present, it is
imported into the sixth field (= norm2). A second or alternative
normalized form may be placed in the fifth field (= norm1). For Menotic
XML (a), the value is taken from the element <code>&lt;me:norm&gt;</code>, for TEI P5 XML
(b) it is taken from <code>&lt;reg&gt;</code>. All descending elements of <code>&lt;me:norm&gt;</code> or
&lt;reg&gt; are processed (see below). If the word in question is marked up as
a descendant of <code>&lt;unclear&gt;</code>, <code>&lt;supplied&gt;</code>, <code>&lt;add&gt;</code>, <code>&lt;del&gt;</code>, <code>&lt;sic&gt;</code>,
<code>&lt;corr&gt;</code> or <code>&lt;surplus&gt;</code> / <code>&lt;me:suppressed&gt;</code> (or <code>&lt;me:expunged&gt;</code>) the
relevant editorial markup is automatically inserted around the word
form. The characters used are the same as for changes or emendations
within a word (see below).
</p>

<p>
The seventh field (= dipl) is populated with the diplomatic word form.
In Menotic XML (a) it is read from the element <code>&lt;me:dipl&gt;</code>, in TEI P5
XML (b) from <code>&lt;orig&gt;</code> with the contents of all descendant <code>&lt;ex&gt;</code>
elements (displayed in parentheses), while the contents of <code>&lt;am&gt;</code> is
suppressed. All other descending elements of <code>&lt;orig&gt;</code> and <code>&lt;me:dipl&gt;</code>
are processed as normal. If the word in question is marked up as a
descendant of <code>&lt;unclear&gt;</code>, <code>&lt;supplied&gt;</code>, <code>&lt;add&gt;</code>, <code>&lt;del&gt;</code>, <code>&lt;sic&gt;</code>,
<code>&lt;corr&gt;</code> or <code>&lt;surplus&gt;</code> / <code>&lt;me:suppressed&gt;</code> (or <code>&lt;me:expunged&gt;</code>) the
relevant editorial markup is automatically inserted around the word
form. The characters used are the same as for changes or emendations
within a word (see below). If the input contains a single-level
transcription, in which the text is simply transcribed within <code>&lt;w&gt;</code>
(i.e. without any <code>&lt;choice&gt;</code> and respective child elements, the
transcription is assumed to be on the diplomatic level and therefore
read into the seventh field. In case there are both a <code>&lt;sic&gt;</code> and
<code>&lt;corr&gt;</code> form encoded for a word in a single-level transcription the
corrected form is printed in the current field (whereas the sic-form is
given in the eighth field).
</p>

<p>
The eighth field (= facs) is populated with the facsimile word form. In
Menotic XML (a) it is read from the element <code>&lt;me:facs&gt;</code>, in TEI P5 XML
(b) from <code>&lt;orig&gt;</code> with the contents of all descendant <code>&lt;am&gt;</code> elements,
while the contents of <code>&lt;ex&gt;</code> is suppressed. All other descending
elements of <code>&lt;orig&gt;</code> and <code>&lt;me:facs&gt;</code> are processed as normal. If the
word in question is marked up as a descendant of <code>&lt;unclear&gt;</code>,
<code>&lt;supplied&gt;</code>, <code>&lt;add&gt;</code>, <code>&lt;del&gt;</code>, <code>&lt;sic&gt;</code>, <code>&lt;corr&gt;</code> or
<code>&lt;surplus&gt;</code> / <code>&lt;me:suppressed&gt;</code> (or <code>&lt;me:expunged&gt;</code>) the relevant
editorial markup is automatically inserted around the word form. The
characters used are the same as for changes or emendations within a word
(see below).
</p>

<p>
The ninth field (= word/image nummer) is populated automatically, counting all
<code>&lt;w&gt;</code>, <code>&lt;pc&gt;</code> (or <code>&lt;me:punct&gt;</code>) and <code>&lt;num&gt;</code> elements in the <code>&lt;body&gt;</code>. The output
is given as a six digit number. If @n is encoded for <code>&lt;w&gt;</code> it is not
considered. If the actual order of words in an artefact differs from the
logical order (or the order it should be read in), the reordering of
the words in question is noted in this field by adding additional
numbers in parentheses behind the numbers. Note that the expected format for 
marking up reordered text follows the guidelines of the Menota Handbook v.3 with 
multiple <code>&lt;lb&gt;</code> milestones that carry different <code>@rend</code> attributes
to indicate the physical rendition of the part of the lines
in question.) The parentheses first print the value of <code>@rend</code> of 
the preceding &lt;lb&gt; (if it has one), followed by a hyphen and the 
position of the word or punctuation character within the given part 
of the line. *<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>*
</p>

<p>
The tenth field (= paleograph. annot.) reads in palaeogaphic
information. More specifically, it imports the contents of <code>&lt;me:pal&gt;</code> if
present. Furthermore, if initials are encoded using <code>&lt;c&gt;</code>
or <code>&lt;hi&gt;</code>, the values of all potential attributes are read and printed in this field,
separated by broken pipe characters. The contents of <code>&lt;c&gt;</code> or <code>&lt;hi&gt;</code> is 
reproduced in the fields for the facsimile (and potentially diplomatic)
form of the word according to the XML encoding.
<b>[Note that in case a hyphen is encoded with <code>&lt;c&gt;</code> and <code>@type</code> of the value <code>hyphen</code> this attribute value as well as potential others,
such as <code>@resp</code> are reproduced here.]</b>
</p>

<p>
The eleventh field (= grapho-phon. annot.) does at present not read in
anything from the XML input.
</p>

<p>
The twelfth field (= notes) imports the contents of any <code>&lt;note&gt;</code>
elements that might be associated with a <code>&lt;w&gt;</code>. Please note that only
<code>&lt;note&gt;</code> elements <i>within</i> <code>&lt;w&gt;</code> are processed correctly, while
potential <code>&lt;note&gt;</code> elements placed immediately following or elsewhere
are not considered.
</p>

<p>
The thirteenth field (= language) holds the language key for the word.
If any ancestor element (e.g. <code>&lt;div&gt;</code>, <code>&lt;p&gt;</code>, <code>&lt;seg&gt;</code>) has an attribute
@xml:lang, the attribute's value of the closest element with such an
attribute is inserted. Otherwise, the stylesheet checks for the presence
of the element <code>&lt;langUsage&gt;</code> in the header and reads out any descendant
elements <code>&lt;language&gt;</code> for their respective @ident. If several
<code>&lt;language&gt;</code> elements are present, the different values of @ident are
imported and separated by white space.
</p>

<p>
The fourteenth and fifteenth field (= extra1 and extra2) are additional
fields for project specific information. Currently, the fourteenth field
(= extra1) is used for reading in information on multiple morphemes if
encoded in the XML. The information from the separate <code>&lt;m&gt;</code> elements, as
in the example below, is represented by the same number of pairs of
curly brackets that contain a mapping of the contents to the value of
@baseform separated by a colon (see example).
</p>


<div class="org-src-container">
<label class="org-src-name">Example of XML with <code>&lt;m&gt;</code> elements</label>
<pre class="src src-xml">&lt;<span style="color: #edd400; font-weight: bold;">w</span> <span style="color: #729fcf;">me</span>:<span style="color: #ff6347;">msa</span>=<span style="color: #ad7fa8; font-style: italic;">"xNP gM nS cD sI"</span> <span style="color: #ff6347;">lemma</span>=<span style="color: #ad7fa8; font-style: italic;">"I&#240;av&#491;llr"</span>&gt;
                            &lt;<span style="color: #edd400; font-weight: bold;">m</span> <span style="color: #ff6347;">baseForm</span>=<span style="color: #ad7fa8; font-style: italic;">"i&#240;"</span>&gt;I&#240;a&lt;/<span style="color: #edd400; font-weight: bold;">m</span>&gt;
                            &lt;<span style="color: #edd400; font-weight: bold;">m</span> <span style="color: #ff6347;">baseForm</span>=<span style="color: #ad7fa8; font-style: italic;">"v&#491;llr"</span>&gt;v&#491;llr&lt;/<span style="color: #edd400; font-weight: bold;">m</span>&gt;
                            &lt;<span style="color: #edd400; font-weight: bold;">choice</span>&gt;
                                &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">facs</span>&gt;&#305;&#240;a uell&#305;&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">facs</span>&gt;
                                &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">dipl</span>&gt;i&#240;a uelli&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">dipl</span>&gt;
                                &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">norm</span>&gt;I&#240;avelli&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">norm</span>&gt;
                            &lt;/<span style="color: #edd400; font-weight: bold;">choice</span>&gt;
                        &lt;/<span style="color: #edd400; font-weight: bold;">w</span>&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-orgmode">| {ið:Iða}{vǫllr:vǫllr} |
</pre>
</div>

<p>
In case of an additional attribute <code>@type</code> (e.g. with the value of
"prefix", "root" or "suffix"), this value is added at the end, separated
by another colon.
</p>

<p>
The sixteenth field (= spacing?) holds information on two (or more)
words, numbers or punctuation characters that are written together in
the original. If an element <code>&lt;seg&gt;</code> with an attribute <code>@type</code> and the
value <code>nb</code> or <code>enc</code> is present in the transcription enclosing the words
in question, the XSL stylesheet inserts equal signs or not-equal signs, respectively.
For the first word
of the segment either one equal sign or a non-equal sign is printed
 and an additional equal sign/non-equal sign for every following. E.g. if
three words are written together in the original and encoded in the XML
using <code>&lt;seg&gt;</code> with <code>@type</code> of the value <code>nb</code>, the output will show a single equal sign in the
sixteenth field of the first word, two equal signs in the sixteenth
field of the second word, and three equal signs in the respective field
for the third word.
<b>[Note: The number of equal signs (or non-equal signs) in case of three or more element is to be changed in the elisp handling in such a way that the last element of such a 
sequence always has two equal signs, while the intermediate ones can have more]</b>
</p>

<p>
The seventeenth and final field (= position in source) is automatically
populated with the information of both the page/folio and line
information of where the word is located based on the present encoding
of <code>&lt;pb/&gt;</code>, <code>&lt;lb/&gt;</code> and potentially <code>&lt;cb/&gt;</code> and the values of their
respective <code>@n</code>. Any markup for page breaks, line breaks or column
breaks found in editions (expected to be marked with @type="ed" or @ed)
are ignored.
</p>

<p>
For <code>&lt;pb/&gt;</code> <code>@n</code> is expected to contain a string of up to four
characters, i.e. usually a number of one to three digits
 combined with r or v for
<i>recto</i> or <i>verso</i>; for <code>&lt;lb/&gt;</code> <code>@n</code> is expected to
contain a single number (no letters!) of a maximum of two digits; for
<code>&lt;cb/&gt;</code> the value of @n is expected to be a single letter. The output
format is <code>[0-9][0-9][0-9][rv]-[0-9][0-9]</code> for folio/page-leaf (e.g.
023r-09). In case the primary source is written in more than one column
and this in encoded in the XML using <code>&lt;cb/&gt;</code>, the letter of the column
is added to the end of the folio/page information (e.g. 023ra-07). If a
word is written on more than one line and this fact is encoded with a
<code>&lt;lb/&gt;</code> (and potentially also <code>&lt;pb/&gt;</code> or <code>&lt;cb/&gt;</code>) inside the <code>&lt;w&gt;</code> in
question, the seventeenth field also reads in the location of the second
and potentially further parts of the word. The format for the position
is always the same; the multiple elements are separated by an m-dash
(e.g. 123v-09&#x2014;123v-10).
</p>
</div>
</div>
