documentation/Documentation-for-xslt-import.org
*** Page breaks, line breaks and column breaks (including hyphenation)
Markup for page breaks, line breaks, column breaks
 is treated differently depending on whether the milestone
elements =<pb>=, =<lb>= and =<cb>=, are found outside of words or
within. In the former case, the milestone elements are simply converted
into a line in the output as shown in the example.

#+CAPTION: Example of =<lb/>= in XML input (with its preceding =<pb/>= and =<cb/>=)
#+BEGIN_SRC xml
    <pb n="126r" type="ms"/><cb n="a"/>
    .....
    <lb n="15" type="ms" rend="3"/>
#+END_SRC

#+BEGIN_SRC orgmode
    | lm | 126ra-15 |  | 3 | | | | | | | | | | | | | |
#+END_SRC

The first field of that line holds the type designation:

-  =pm= for a page break found in a manuscript
-  =pe= for a page break in a relevant edition (expected to be specified
   with either @ed or @type="ed" if encoded)
-  =lm= for a line break in a manuscript
-  =le= for a line break in a relevant edition (expected to be specified
   with either @ed or @type="ed")
-  =cm= for a column break in a manuscript
-  =ce= for a column break in a relevant edition (expected to specified
   with either @ed or @type="ed")
-  =gb= for a gathering break in a manuscript
-  =hs= for a hand shift in a manuscript

The second field holds information about the place, i.e. the number of
the break in question. For =<pb/>= the number is read from its =@n=,
which is expected to contain a string of up to four characters, i.e.
usually a number of one to three digits combined with 'r' or 'v' for
 /recto/ or /verso/
for a page break in a manuscript or a number of up to four digits for a
page break in an edition. If a format with less numbers are encoded, the
stylesheet automatically prepends zeros to produce a string of four
characters. For =<cb/>= (if present) the number is a combination of the
preceding =<pb>= and its own =@n= attributes, the latter being expected
to contain a single letter. The four digits from the page break and the
letter from the column break are printed without any additional syntax
(e.g. "126ra"). For =<lb/>= the number is a combination of the preceding
=<pb>=, potentially =<cb>=, and its own =@n= attributes, the latter
being expected to contain a single number (no letters!) of a maximum of
two digits. The folio/page number (potentially including the column
number) and the line number are separated in the output by a hyphen if
the line break is found in a manuscript (e.g. 023r-09 or 023rb-10) and
by a dot if the line break is from an edition (e.g. 0126.12). Line
numbers below 10 are automatically rendered with a preceding zero. In
case line breaks, page breaks and potentially column breaks from both
the manuscript and an edition are encoded, only preceding milestone
elements of the same type are considered.

The third field reads in any value of a potentially present =@facs=
attribute (which is e.g. common for =<pb>= if there is a mapping to
facsimile images.

The fourth field reads in any value of a potentially present =@rend=
attribute, which is common for =<lb>= if the logical order of
the words does not agree with the physical order (in this case <lb>
is expected to be encoded for each part of the line, with the same 
value of =@n=, but the
multiple milestone elements are distinguished by a counting =@rend=).

The remaining fields of the output line are left empty.

If page breaks, line breaks or column breaks occur within a word the
exact location of the milestone element is retained by means of
inserting a double pipe character for page breaks in a manuscript and
double forward slashes (&dblsol;) for a page break in an edition; a single broken
pipe character for a line break in a manuscript and a single &fracsol; (⁄)
 for a line break in an edition; double closing parentheses for a 
column break in a manuscript and double opening
parentheses for a column break in an edition.
In case a line break element also has a =@rend= attribute, because the 
logical order differs from the physical, the stylesheet prints
a broken pipe character + '@rend' + the value of the rend-attribute +
a broken pipe character.
*[ This additional markup for =<lb>= in words with @rend is expected to be removed after handling the text in elisp, as the word/image number field 
will contain that information.]*  

In case of hyphenation at a line break the stylesheet simply reproduces
any hyphens that are marked up in the XML as present in the manuscript, 
i.e. not as supplied, without further markup. That is also the case
when the element =<lb/>= has a =@rend= with the value =hyphen= or when 
a hyphen is typed as such and additionally wrapped in =<c>= with a 
=@type= of the value =hyphen=. 
If a hyphen is supplied and wrapped in =<supplied>=, it is treated like
other supplied characters. If it is wrapped in =<me:punct>= (inside of a word) with a
=@type= of the value =supplied= it is treated in the same way as if it 
was wrapped in =<supplied>= the only difference being that potential information
about the reason for the supplement, i.e. =omitted= or =illegible= is expected
to be the value of =@subtype= instead of =@reason=.


