documentation/Documentation-for-xslt-import.html


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Page breaks, line breaks and column breaks (including hyphenation)</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Markup for page breaks, line breaks, column breaks
 is treated differently depending on whether the milestone
elements <code>&lt;pb&gt;</code>, <code>&lt;lb&gt;</code> and <code>&lt;cb&gt;</code>, are found outside of words or
within. In the former case, the milestone elements are simply converted
into a line in the output as shown in the example.
</p>

<div class="org-src-container">
<label class="org-src-name">Example of <code>&lt;lb/&gt;</code> in XML input (with its preceding <code>&lt;pb/&gt;</code> and <code>&lt;cb/&gt;</code>)</label>
<pre class="src src-xml">&lt;<span style="color: #edd400; font-weight: bold;">pb</span> <span style="color: #ff6347;">n</span>=<span style="color: #ad7fa8; font-style: italic;">"126r"</span> <span style="color: #ff6347;">type</span>=<span style="color: #ad7fa8; font-style: italic;">"ms"</span>/&gt;&lt;<span style="color: #edd400; font-weight: bold;">cb</span> <span style="color: #ff6347;">n</span>=<span style="color: #ad7fa8; font-style: italic;">"a"</span>/&gt;
.....
&lt;<span style="color: #edd400; font-weight: bold;">lb</span> <span style="color: #ff6347;">n</span>=<span style="color: #ad7fa8; font-style: italic;">"15"</span> <span style="color: #ff6347;">type</span>=<span style="color: #ad7fa8; font-style: italic;">"ms"</span> <span style="color: #ff6347;">rend</span>=<span style="color: #ad7fa8; font-style: italic;">"3"</span>/&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-orgmode">| lm | 126ra-15 |  | 3 | | | | | | | | | | | | | |
</pre>
</div>

<p>
The first field of that line holds the type designation:
</p>

<ul class="org-ul">
<li><code>pm</code> for a page break found in a manuscript
</li>
<li><code>pe</code> for a page break in a relevant edition (expected to be specified
with either @ed or @type="ed" if encoded)
</li>
<li><code>lm</code> for a line break in a manuscript
</li>
<li><code>le</code> for a line break in a relevant edition (expected to be specified
with either @ed or @type="ed")
</li>
<li><code>cm</code> for a column break in a manuscript
</li>
<li><code>ce</code> for a column break in a relevant edition (expected to specified
with either @ed or @type="ed")
</li>
<li><code>gb</code> for a gathering break in a manuscript
</li>
<li><code>hs</code> for a hand shift in a manuscript
</li>
</ul>

<p>
The second field holds information about the place, i.e. the number of
the break in question. For <code>&lt;pb/&gt;</code> the number is read from its <code>@n</code>,
which is expected to contain a string of up to four characters, i.e.
usually a number of one to three digits combined with 'r' or 'v' for
 <i>recto</i> or <i>verso</i>
for a page break in a manuscript or a number of up to four digits for a
page break in an edition. If a format with less numbers are encoded, the
stylesheet automatically prepends zeros to produce a string of four
characters. For <code>&lt;cb/&gt;</code> (if present) the number is a combination of the
preceding <code>&lt;pb&gt;</code> and its own <code>@n</code> attributes, the latter being expected
to contain a single letter. The four digits from the page break and the
letter from the column break are printed without any additional syntax
(e.g. "126ra"). For <code>&lt;lb/&gt;</code> the number is a combination of the preceding
<code>&lt;pb&gt;</code>, potentially <code>&lt;cb&gt;</code>, and its own <code>@n</code> attributes, the latter
being expected to contain a single number (no letters!) of a maximum of
two digits. The folio/page number (potentially including the column
number) and the line number are separated in the output by a hyphen if
the line break is found in a manuscript (e.g. 023r-09 or 023rb-10) and
by a dot if the line break is from an edition (e.g. 0126.12). Line
numbers below 10 are automatically rendered with a preceding zero. In
case line breaks, page breaks and potentially column breaks from both
the manuscript and an edition are encoded, only preceding milestone
elements of the same type are considered.
</p>

<p>
The third field reads in any value of a potentially present <code>@facs</code>
attribute (which is e.g. common for <code>&lt;pb&gt;</code> if there is a mapping to
facsimile images.
</p>

<p>
The fourth field reads in any value of a potentially present <code>@rend</code>
attribute, which is common for <code>&lt;lb&gt;</code> if the logical order of
the words does not agree with the physical order (in this case &lt;lb&gt;
is expected to be encoded for each part of the line, with the same 
value of <code>@n</code>, but the
multiple milestone elements are distinguished by a counting <code>@rend</code>).
</p>

<p>
The remaining fields of the output line are left empty.
</p>

<p>
If page breaks, line breaks or column breaks occur within a word the
exact location of the milestone element is retained by means of
inserting a double pipe character for page breaks in a manuscript and
double forward slashes (&amp;dblsol;) for a page break in an edition; a single broken
pipe character for a line break in a manuscript and a single &amp;fracsol; (⁄)
 for a line break in an edition; double closing parentheses for a 
column break in a manuscript and double opening
parentheses for a column break in an edition.
In case a line break element also has a <code>@rend</code> attribute, because the 
logical order differs from the physical, the stylesheet prints
a broken pipe character + '@rend' + the value of the rend-attribute +
a broken pipe character.
<b>[ This additional markup for <code>&lt;lb&gt;</code> in words with @rend is expected to be removed after handling the text in elisp, as the word/image number field 
will contain that information.]</b>  
</p>

<p>
In case of hyphenation at a line break the stylesheet simply reproduces
any hyphens that are marked up in the XML as present in the manuscript, 
i.e. not as supplied, without further markup. That is also the case
when the element <code>&lt;lb/&gt;</code> has a <code>@rend</code> with the value <code>hyphen</code> or when 
a hyphen is typed as such and additionally wrapped in <code>&lt;c&gt;</code> with a 
<code>@type</code> of the value <code>hyphen</code>. 
If a hyphen is supplied and wrapped in <code>&lt;supplied&gt;</code>, it is treated like
other supplied characters. If it is wrapped in <code>&lt;me:punct&gt;</code> (inside of a word) with a
<code>@type</code> of the value <code>supplied</code> it is treated in the same way as if it 
was wrapped in <code>&lt;supplied&gt;</code> the only difference being that potential information
about the reason for the supplement, i.e. <code>omitted</code> or <code>illegible</code> is expected
to be the value of <code>@subtype</code> instead of <code>@reason</code>.
</p>
</div>
</div>
