documentation/Documentation-for-xslt-import.org
*** Gathering boundaries, hand shift, gaps (when not indicating lost words), space and metamarks 
While metamarks are expected
to only occur outside of words, the markup for gaps, gathering breaks, space and
 hand shift is treated differently
depending on whether the milestone elements =<gb/>=, =<handShift/>=, =<gap/>= and
=<space/>= are found outside of words or within. In the former case, the
elements are simply converted into a line in the output (see example below). 
In the latter case, both a special character is
printed within the word to indicate the exact location (see below) and a line 
is produced preceding the word that contains the milestone element in order
to retain potential additional information from any present attributes. 

#+CAPTION: Example of XML with =<space/>= element
#+BEGIN_SRC xml
    <space extent="3" unit="lines" dim="vertical" resp="BS"/>
#+END_SRC

#+BEGIN_SRC orgmode
    | sp |  | 3_lines | vertical |  | BS | | | | | | | | | | | |
#+END_SRC

The first field of that line holds the type designation: Gathering
breaks are marked with =gb=, hand shifts with =hs=, space with =sp=, gap
with =ga= and metamarks with =mm=.

The second field contains an =X= if the element in question
occurs within a word. 

The third field holds different information depending on the element in
question:

-  For =<gb/>= the number is printed unchanged from the attribute =@n=
   (which is expected to be present).
-  For =<handShift/>= the ID of the new scribe is taken from the
   attribute =@new= (which is also expected).
-  For =<space>= and =<gap>= the second field holds information on the
   extent of the space or gap and its unit if encoded in the XML. The
   value for the extent is read from either =@quantity= or =@extent=,
   followed by the value of =@unit=, which is preceded by an underscore
   if present.
-  For =<metamark>=, the second field reads in the value of =@function=
   if present.

If the element in question is =<space>= the fourth field reads in the
value of any present =@dim= attribute (i.e. "horizontal" or "vertical").
For =<metamark>=, the value of any present =@target= attribute is
printed, and for =<gap>=, the value of =@reason=. For the other elements
this field is currently left blank.

The fifth field reads in information of any present =@rend= attribute
on =<metamark>= or =@agent= attribute on =<gap>=.

The sixth field gives the value of any present =@resp= attributes on
both =<gap>= and =<space>=, or =@ana= attribute on =<metamark>=.

The seventh field grabs any textual contents of =<metamark>= (on any level).

The eighth field retains information about potential descendant elements of 
=<metamark>=. In other words, if =<metamark>= holds child elements, this field
 prints for each contained element the element name followed by an underscore,
the name of a potential attribute or attributes, an equal sign and the value of
the attribute or attributes. Finally, the information on an individual 
element is closed by a broken pipe character. If a contained element
does not have any attribute, the stylesheet prints 
"_instant=false" for the non-existing attribute and its value.

The remaining fields are left empty.

