documentation/Documentation-for-xslt-import.html


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Gathering boundaries, hand shift, gaps (when not indicating lost words), space and metamarks</h3>
<div class="outline-text-3" id="text-2-3">
<p>
While metamarks are expected
to only occur outside of words, the markup for gaps, gathering breaks, space and
 hand shift is treated differently
depending on whether the milestone elements <code>&lt;gb/&gt;</code>, <code>&lt;handShift/&gt;</code>, <code>&lt;gap/&gt;</code> and
<code>&lt;space/&gt;</code> are found outside of words or within. In the former case, the
elements are simply converted into a line in the output (see example below). 
In the latter case, both a special character is
printed within the word to indicate the exact location (see below) and a line 
is produced preceding the word that contains the milestone element in order
to retain potential additional information from any present attributes. 
</p>

<div class="org-src-container">
<label class="org-src-name">Example of XML with <code>&lt;space/&gt;</code> element</label>
<pre class="src src-xml">&lt;<span style="color: #edd400; font-weight: bold;">space</span> <span style="color: #ff6347;">extent</span>=<span style="color: #ad7fa8; font-style: italic;">"3"</span> <span style="color: #ff6347;">unit</span>=<span style="color: #ad7fa8; font-style: italic;">"lines"</span> <span style="color: #ff6347;">dim</span>=<span style="color: #ad7fa8; font-style: italic;">"vertical"</span> <span style="color: #ff6347;">resp</span>=<span style="color: #ad7fa8; font-style: italic;">"BS"</span>/&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-orgmode">| sp |  | 3_lines | vertical |  | BS | | | | | | | | | | | |
</pre>
</div>

<p>
The first field of that line holds the type designation: Gathering
breaks are marked with <code>gb</code>, hand shifts with <code>hs</code>, space with <code>sp</code>, gap
with <code>ga</code> and metamarks with <code>mm</code>.
</p>

<p>
The second field contains an <code>X</code> if the element in question
occurs within a word. 
</p>

<p>
The third field holds different information depending on the element in
question:
</p>

<ul class="org-ul">
<li>For <code>&lt;gb/&gt;</code> the number is printed unchanged from the attribute <code>@n</code>
(which is expected to be present).
</li>
<li>For <code>&lt;handShift/&gt;</code> the ID of the new scribe is taken from the
attribute <code>@new</code> (which is also expected).
</li>
<li>For <code>&lt;space&gt;</code> and <code>&lt;gap&gt;</code> the second field holds information on the
extent of the space or gap and its unit if encoded in the XML. The
value for the extent is read from either <code>@quantity</code> or <code>@extent</code>,
followed by the value of <code>@unit</code>, which is preceded by an underscore
if present.
</li>
<li>For <code>&lt;metamark&gt;</code>, the second field reads in the value of <code>@function</code>
if present.
</li>
</ul>

<p>
If the element in question is <code>&lt;space&gt;</code> the fourth field reads in the
value of any present <code>@dim</code> attribute (i.e. "horizontal" or "vertical").
For <code>&lt;metamark&gt;</code>, the value of any present <code>@target</code> attribute is
printed, and for <code>&lt;gap&gt;</code>, the value of <code>@reason</code>. For the other elements
this field is currently left blank.
</p>

<p>
The fifth field reads in information of any present <code>@rend</code> attribute
on <code>&lt;metamark&gt;</code> or <code>@agent</code> attribute on <code>&lt;gap&gt;</code>.
</p>

<p>
The sixth field gives the value of any present <code>@resp</code> attributes on
both <code>&lt;gap&gt;</code> and <code>&lt;space&gt;</code>, or <code>@ana</code> attribute on <code>&lt;metamark&gt;</code>.
</p>

<p>
The seventh field grabs any textual contents of <code>&lt;metamark&gt;</code> (on any level).
</p>

<p>
The eighth field retains information about potential descendant elements of 
<code>&lt;metamark&gt;</code>. In other words, if <code>&lt;metamark&gt;</code> holds child elements, this field
 prints for each contained element the element name followed by an underscore,
the name of a potential attribute or attributes, an equal sign and the value of
the attribute or attributes. Finally, the information on an individual 
element is closed by a broken pipe character. If a contained element
does not have any attribute, the stylesheet prints 
"<sub>instant</sub>=false" for the non-existing attribute and its value.
</p>

<p>
The remaining fields are left empty.
</p>
</div>
</div>
