documentation/Documentation-for-xslt-import.org
*** Names
Words that are names receive an additional code line both in front and
after the line marked as "w". These two lines correspond to beginning and
end tags as in XML and are marked with =b= or =e=, respectively, in the
second field as shown in example (a):

#+CAPTION: (a)
#+BEGIN_SRC xml
    <persName type="forename">
        <w me:msa="xNP gM nS cN sI" lemma="Árni" me:lemma-orig="árni">
            <choice>
                <me:facs>arn<am>&bar;</am>æ</me:facs>
                <me:dipl>arn<ex>n</ex>æ</me:dipl>
                <me:norm>Árni</me:norm>
            </choice>
        </w>
    </persName>
#+END_SRC

#+BEGIN_SRC orgmode
    | PE | b    | AsvTho001 | forename        |      |      |         |    |        |        |                          |   |     |   |   |   |         |   |
    | w  | árni | Árni      | xNP gM nS cN sI | Árni | Árni | arn(n)æ | arn̅æ | 000036 | a2;æ2; | {a:[á,a]}{r:r}{n̅:n}{æ:I}   |   | oic |   |   |   | 168r-03 |   |
    | PE | e    | AsvTho001 | forename        |      |      |         |    |        |        |                          |   |     |   |   |   |         |   |
#+END_SRC

The beginning and end lines are structured in (almost) the same way,
taking into consideration the most common ways of marking up names in
XML. The stylesheet expects that when the plain =<name>= element is
used, it always has at least a =@type= attribute, since it cannot be
processed otherwise. If any naming elements are nested, beginning and
ending lines are only be inserted for the lowest level of naming elements.
In other words, an encoding such as the following (example (b) results in
 the below
code. Please note that any =<w>= that might be contained
in a higher level name element, but is not surrounded by a lower level
element that is comparable to the encoding of the other sibling =<w>=
elements, is treated as if it were not a name.

#+CAPTION: (b)
#+BEGIN_SRC xml
           <w lemma="frú" me:msa="xNC gF nS cN sI">
                <choice>
                    <me:facs></me:facs>
                    <me:dipl>fru</me:dipl>
                    <me:norm>frú</me:norm>
                </choice>
            </w>
    <name type="person" key="HalJon001">
        <persName type="forename">
            <w lemma="hallbera" me:msa="xNP gF nS cG sI">
                <choice>
                    <me:facs></me:facs>
                    <me:dipl>Hallb<ex>er</ex>a</me:dipl>
                    <me:norm>Hallbera</me:norm>
                </choice>
            </w>
        </persName>
        <w lemma="abbadís" me:msa="xNC gF nS cN sI">
            <choice>
                <me:facs></me:facs>
                <me:dipl>abbadis</me:dipl>
                <me:norm>abbadís</me:norm>
            </choice>
        </w>
        <addName type="patronym">
            <w lemma="Jónsdóttir" me:msa="xNC gF nS cN sI">
                <choice>
                    <me:facs></me:facs>
                    <me:dipl>jonsd<ex>ottir</ex></me:dipl>
                    <me:norm>Jónsdóttir</me:norm>
                </choice>
            </w>
        </persName>
    </name>
#+END_SRC

#+BEGIN_SRC orgmode
| w  | frú        |           | xNC gF nS cN sI |     | frú             | fru          |   | 000003 |   |   |   | oic |   |   |   | 003r-02 |   |
| PE | b          | HalJon001 | forename        | np1 | →HalJon001/3-02 |              |   |        |   |   |   |     |   |   |   |      |   |
| w  | hallbera   |           | xNP gF nS cG sI |     | Hallbera        | halb(er)a    |   | 000004 |   |   |   | oic |   |   |   | 003r-02 |   |
| PE | e          | HalJon001 | forename        | np1 |                 |              |   |        |   |   |   |     |   |   |   |      |   |
| w  | abbadís    |           | xNC gF nS cN sI |     | abbadís         | abbadis      |   | 000005 |   |   |   | oic |   |   |   | 003r-02 |   |
| PE | b          | HalJon001 | patronym        | np2 | #HalJon001/3-02 |              |   |        |   |   |   |     |   |   |   |      |   |
| w  | Jónsdóttir |           | xNC gF nS cN sI |     | Jónsdóttir      | jonsd(ottir) |   | 000006 |   |   |   | oic |   |   |   | 003r-02 |   |
| PE | e          | HalJon001 | patronym        | np2 |                 |              |   |        |   |   |   |     |   |   |   |      |   |
#+END_SRC


The first field holds the type designation (the same for beg. and end).
For the elements =<persName>=, =<forename>=, =<surname>=, =<addName>=,
=<roleName>=, =<nameLink>= and =<name>= with @type="name", the type is
given as =PE= (for Personal Name). For the elements =<placeName>= or
=<name>= with @type="place", =PL= is printed, and finally for =<name>=
with @type="org" or "organization" =OR= is inserted.

The second field holds =b= in the beginning line to mark the start of a
name and =e= in the end line.

The third field takes the ID or a reference to an authority file if such
information is encoded. The stylesheet reads in the value of potential
=@ref/@me:ref= or =@key/me:key=. If no key or reference is encoded on
the element in question, XSLT checks if a potential ancestor naming
element carries such information, and inserts it. If not, the field is
left empty.

The fourth field reads in additional information on the type of name if
it is a personal name. Depending on the encoding of the XML, the
information is either directly read from the element name (e.g.
=<forename>=, =<surname>=) or from attributes (e.g. =@type=,
=@subtype=). For place names and other names, no additional information
is expected.

The fifth field is used to indicate when a name consists of several
parts (as in example (b). If the individual name parts are nested inside
a common naming element (=<name>=, =<persName>= or =<placeName>=), the
stylesheet inserts automatically information of where the individual
parts are placed within the common ancestor element as =np1= (= name
part 1), =np2=, =np3= or =np4=.

The following fields are currently not used and are not populated by the
stylesheet. The sixth field will probably be used for references in case
of multi-part names, in order to be able to point from one part to the
other with a (more or less) unique identifier. The example shows a 
pointer in a prelimiary format. *[:TODO: Is this inserted
in EMACS using LISP? ASK sørger for at det sker fra elisp.]*

