documentation/Documentation-for-xslt-import.html

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Names</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Words that are names receive an additional code line both in front and
after the line marked as "w". These two lines correspond to beginning and
end tags as in XML and are marked with <code>b</code> or <code>e</code>, respectively, in the
second field as shown in example (a):
</p>

<div class="org-src-container">
<label class="org-src-name">(a)</label>
<pre class="src src-xml">&lt;<span style="color: #edd400; font-weight: bold;">persName</span> <span style="color: #ff6347;">type</span>=<span style="color: #ad7fa8; font-style: italic;">"forename"</span>&gt;
    &lt;<span style="color: #edd400; font-weight: bold;">w</span> <span style="color: #729fcf;">me</span>:<span style="color: #ff6347;">msa</span>=<span style="color: #ad7fa8; font-style: italic;">"xNP gM nS cN sI"</span> <span style="color: #ff6347;">lemma</span>=<span style="color: #ad7fa8; font-style: italic;">"&#193;rni"</span> <span style="color: #729fcf;">me</span>:<span style="color: #ff6347;">lemma-orig</span>=<span style="color: #ad7fa8; font-style: italic;">"&#225;rni"</span>&gt;
        &lt;<span style="color: #edd400; font-weight: bold;">choice</span>&gt;
            &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">facs</span>&gt;arn&lt;<span style="color: #edd400; font-weight: bold;">am</span>&gt;<span style="color: #8ae234;">&amp;</span><span style="color: #8ae234;">bar</span><span style="color: #8ae234;">;</span>&lt;/<span style="color: #edd400; font-weight: bold;">am</span>&gt;&#230;&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">facs</span>&gt;
            &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">dipl</span>&gt;arn&lt;<span style="color: #edd400; font-weight: bold;">ex</span>&gt;n&lt;/<span style="color: #edd400; font-weight: bold;">ex</span>&gt;&#230;&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">dipl</span>&gt;
            &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">norm</span>&gt;&#193;rni&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">norm</span>&gt;
        &lt;/<span style="color: #edd400; font-weight: bold;">choice</span>&gt;
    &lt;/<span style="color: #edd400; font-weight: bold;">w</span>&gt;
&lt;/<span style="color: #edd400; font-weight: bold;">persName</span>&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-orgmode">| PE | b    | AsvTho001 | forename        |      |      |         |    |        |        |                          |   |     |   |   |   |         |   |
| w  | árni | Árni      | xNP gM nS cN sI | Árni | Árni | arn(n)æ | arn̅æ | 000036 | a2;æ2; | {a:[á,a]}{r:r}{n̅:n}{æ:I}   |   | oic |   |   |   | 168r-03 |   |
| PE | e    | AsvTho001 | forename        |      |      |         |    |        |        |                          |   |     |   |   |   |         |   |
</pre>
</div>

<p>
The beginning and end lines are structured in (almost) the same way,
taking into consideration the most common ways of marking up names in
XML. The stylesheet expects that when the plain <code>&lt;name&gt;</code> element is
used, it always has at least a <code>@type</code> attribute, since it cannot be
processed otherwise. If any naming elements are nested, beginning and
ending lines are only be inserted for the lowest level of naming elements.
In other words, an encoding such as the following (example (b) results in
 the below
code. Please note that any <code>&lt;w&gt;</code> that might be contained
in a higher level name element, but is not surrounded by a lower level
element that is comparable to the encoding of the other sibling <code>&lt;w&gt;</code>
elements, is treated as if it were not a name.
</p>

<div class="org-src-container">
<label class="org-src-name">(b)</label>
<pre class="src src-xml">       &lt;<span style="color: #edd400; font-weight: bold;">w</span> <span style="color: #ff6347;">lemma</span>=<span style="color: #ad7fa8; font-style: italic;">"fr&#250;"</span> <span style="color: #729fcf;">me</span>:<span style="color: #ff6347;">msa</span>=<span style="color: #ad7fa8; font-style: italic;">"xNC gF nS cN sI"</span>&gt;
            &lt;<span style="color: #edd400; font-weight: bold;">choice</span>&gt;
                &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">facs</span>&gt;&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">facs</span>&gt;
                &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">dipl</span>&gt;fru&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">dipl</span>&gt;
                &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">norm</span>&gt;fr&#250;&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">norm</span>&gt;
            &lt;/<span style="color: #edd400; font-weight: bold;">choice</span>&gt;
        &lt;/<span style="color: #edd400; font-weight: bold;">w</span>&gt;
&lt;<span style="color: #edd400; font-weight: bold;">name</span> <span style="color: #ff6347;">type</span>=<span style="color: #ad7fa8; font-style: italic;">"person"</span> <span style="color: #ff6347;">key</span>=<span style="color: #ad7fa8; font-style: italic;">"HalJon001"</span>&gt;
    &lt;<span style="color: #edd400; font-weight: bold;">persName</span> <span style="color: #ff6347;">type</span>=<span style="color: #ad7fa8; font-style: italic;">"forename"</span>&gt;
        &lt;<span style="color: #edd400; font-weight: bold;">w</span> <span style="color: #ff6347;">lemma</span>=<span style="color: #ad7fa8; font-style: italic;">"hallbera"</span> <span style="color: #729fcf;">me</span>:<span style="color: #ff6347;">msa</span>=<span style="color: #ad7fa8; font-style: italic;">"xNP gF nS cG sI"</span>&gt;
            &lt;<span style="color: #edd400; font-weight: bold;">choice</span>&gt;
                &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">facs</span>&gt;&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">facs</span>&gt;
                &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">dipl</span>&gt;Hallb&lt;<span style="color: #edd400; font-weight: bold;">ex</span>&gt;er&lt;/<span style="color: #edd400; font-weight: bold;">ex</span>&gt;a&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">dipl</span>&gt;
                &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">norm</span>&gt;Hallbera&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">norm</span>&gt;
            &lt;/<span style="color: #edd400; font-weight: bold;">choice</span>&gt;
        &lt;/<span style="color: #edd400; font-weight: bold;">w</span>&gt;
    &lt;/<span style="color: #edd400; font-weight: bold;">persName</span>&gt;
    &lt;<span style="color: #edd400; font-weight: bold;">w</span> <span style="color: #ff6347;">lemma</span>=<span style="color: #ad7fa8; font-style: italic;">"abbad&#237;s"</span> <span style="color: #729fcf;">me</span>:<span style="color: #ff6347;">msa</span>=<span style="color: #ad7fa8; font-style: italic;">"xNC gF nS cN sI"</span>&gt;
        &lt;<span style="color: #edd400; font-weight: bold;">choice</span>&gt;
            &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">facs</span>&gt;&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">facs</span>&gt;
            &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">dipl</span>&gt;abbadis&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">dipl</span>&gt;
            &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">norm</span>&gt;abbad&#237;s&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">norm</span>&gt;
        &lt;/<span style="color: #edd400; font-weight: bold;">choice</span>&gt;
    &lt;/<span style="color: #edd400; font-weight: bold;">w</span>&gt;
    &lt;<span style="color: #edd400; font-weight: bold;">addName</span> <span style="color: #ff6347;">type</span>=<span style="color: #ad7fa8; font-style: italic;">"patronym"</span>&gt;
        &lt;<span style="color: #edd400; font-weight: bold;">w</span> <span style="color: #ff6347;">lemma</span>=<span style="color: #ad7fa8; font-style: italic;">"J&#243;nsd&#243;ttir"</span> <span style="color: #729fcf;">me</span>:<span style="color: #ff6347;">msa</span>=<span style="color: #ad7fa8; font-style: italic;">"xNC gF nS cN sI"</span>&gt;
            &lt;<span style="color: #edd400; font-weight: bold;">choice</span>&gt;
                &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">facs</span>&gt;&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">facs</span>&gt;
                &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">dipl</span>&gt;jonsd&lt;<span style="color: #edd400; font-weight: bold;">ex</span>&gt;ottir&lt;/<span style="color: #edd400; font-weight: bold;">ex</span>&gt;&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">dipl</span>&gt;
                &lt;<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">norm</span>&gt;J&#243;nsd&#243;ttir&lt;/<span style="color: #729fcf;">me</span>:<span style="color: #edd400; font-weight: bold;">norm</span>&gt;
            &lt;/<span style="color: #edd400; font-weight: bold;">choice</span>&gt;
        &lt;/<span style="color: #edd400; font-weight: bold;">w</span>&gt;
    &lt;/<span style="color: #edd400; font-weight: bold;">persName</span>&gt;
&lt;/<span style="color: #edd400; font-weight: bold;">name</span>&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-orgmode">| w  | frú        |           | xNC gF nS cN sI |     | frú             | fru          |   | 000003 |   |   |   | oic |   |   |   | 003r-02 |   |
| PE | b          | HalJon001 | forename        | np1 | →HalJon001/3-02 |              |   |        |   |   |   |     |   |   |   |      |   |
| w  | hallbera   |           | xNP gF nS cG sI |     | Hallbera        | halb(er)a    |   | 000004 |   |   |   | oic |   |   |   | 003r-02 |   |
| PE | e          | HalJon001 | forename        | np1 |                 |              |   |        |   |   |   |     |   |   |   |      |   |
| w  | abbadís    |           | xNC gF nS cN sI |     | abbadís         | abbadis      |   | 000005 |   |   |   | oic |   |   |   | 003r-02 |   |
| PE | b          | HalJon001 | patronym        | np2 | #HalJon001/3-02 |              |   |        |   |   |   |     |   |   |   |      |   |
| w  | Jónsdóttir |           | xNC gF nS cN sI |     | Jónsdóttir      | jonsd(ottir) |   | 000006 |   |   |   | oic |   |   |   | 003r-02 |   |
| PE | e          | HalJon001 | patronym        | np2 |                 |              |   |        |   |   |   |     |   |   |   |      |   |
</pre>
</div>


<p>
The first field holds the type designation (the same for beg. and end).
For the elements <code>&lt;persName&gt;</code>, <code>&lt;forename&gt;</code>, <code>&lt;surname&gt;</code>, <code>&lt;addName&gt;</code>,
<code>&lt;roleName&gt;</code>, <code>&lt;nameLink&gt;</code> and <code>&lt;name&gt;</code> with @type="name", the type is
given as <code>PE</code> (for Personal Name). For the elements <code>&lt;placeName&gt;</code> or
<code>&lt;name&gt;</code> with @type="place", <code>PL</code> is printed, and finally for <code>&lt;name&gt;</code>
with @type="org" or "organization" <code>OR</code> is inserted.
</p>

<p>
The second field holds <code>b</code> in the beginning line to mark the start of a
name and <code>e</code> in the end line.
</p>

<p>
The third field takes the ID or a reference to an authority file if such
information is encoded. The stylesheet reads in the value of potential
<code>@ref/@me:ref</code> or <code>@key/me:key</code>. If no key or reference is encoded on
the element in question, XSLT checks if a potential ancestor naming
element carries such information, and inserts it. If not, the field is
left empty.
</p>

<p>
The fourth field reads in additional information on the type of name if
it is a personal name. Depending on the encoding of the XML, the
information is either directly read from the element name (e.g.
<code>&lt;forename&gt;</code>, <code>&lt;surname&gt;</code>) or from attributes (e.g. <code>@type</code>,
<code>@subtype</code>). For place names and other names, no additional information
is expected.
</p>

<p>
The fifth field is used to indicate when a name consists of several
parts (as in example (b). If the individual name parts are nested inside
a common naming element (<code>&lt;name&gt;</code>, <code>&lt;persName&gt;</code> or <code>&lt;placeName&gt;</code>), the
stylesheet inserts automatically information of where the individual
parts are placed within the common ancestor element as <code>np1</code> (= name
part 1), <code>np2</code>, <code>np3</code> or <code>np4</code>.
</p>

<p>
The following fields are currently not used and are not populated by the
stylesheet. The sixth field will probably be used for references in case
of multi-part names, in order to be able to point from one part to the
other with a (more or less) unique identifier. The example shows a 
pointer in a prelimiary format. <b>[:TODO: Is this inserted
in EMACS using LISP? ASK sørger for at det sker fra elisp.]</b>
</p>
</div>
</div>
