documentation/Documentation-for-xslt-import.org
*** Divisions, heads, segments, paragraphs, line groups and verse lines
The structural elements =<div>=, =<head>=, =<seg>=, =<p>=, =<lg>= and
=<l>= are transformed into beginning and ending lines surrounding the
transcribed text (similar to the markup for names) as shown in the example.

#+CAPTION: Example of =<div>= in XML input
#+BEGIN_SRC xml
    <div n="2.2" type="chapter" subtype="subchapter">
    ....
    </div>
#+END_SRC

#+BEGIN_SRC orgmode
    | d | b | 3 | 2.2 | chapter | subchapter | | | | | | | | | | | |
    ....
    | d | e | 3 |     |         |            | | | | | | | | | | | |
#+END_SRC

The first field is occupied by the type designation, i.e. =d= for
=<div>=, =h= for =<head>=, =s= for =<seg>=, =pa= for =<p>=, =lg= for
=<lg>= and =l= for =<l>=.

The second field contains either =b= to mark a beginning line or =e= for
the end.

The third field holds an internal counter, giving the position of the
element in question in =<body>= (only counting elements of the same name
as self). This internal counter is repeated in the ending line.

The fourth field of a beginning line reads in the value of any present
=@n= attribute. The end line does not repeat this information. For
=<div>= elements the value of =@n= is expected to agree with the =@n= of
the relevant =<msItem>= in the =<msDesc>= part of the header.

The fifth field of a beginning line reads in the value of any present
=@type= attribute. The end line does not repeat this information.

The sixth field of a beginning line reads in the value of any present
=@subtype= attribute. The end line does not repeat this information.

The seventh field of a beginning line reads in the value of any present
=@xml:id= attribute. The end line does not repeat this information.

The eighth field of a beginning line reads in the value of any present
=@rend= attribute. The end line does not repeat this information.

The ninth field of a beginning line reads in the value of any present =@met=
attribute (e.g. on =<l>=). The end line does not repeat this information.

The tenth field of a beginning line reads in the contents of the element
if it contains text that is not further marked up by means of =<w>=,
=<pc>= or =<me:punct>=. The end line does not repeat this information.

The remaining fields are currently left empty.

*** Additions, deletions, supplied, suppressed/surplus, unclear word, quotes and forme work
Elements that mark editorial or scribal changes or emendation and are not
found within words in the XML but rather surrounding words are
transformed into beginning and end lines surrounding the transcribed
text (similar to the markup for names and structural markup). In
addition to that, the word forms in question receive additional
editorial mark-up on all transcriptional levels. If such elements occur
within words, they are converted to the relevant
editorial mark-up (see below) in addition to a single preceding line
that follows the structure of an opening line, but takes =X= in the 
second field.

#+CAPTION: Example of =<supplied>= in XML input
#+BEGIN_SRC xml
    <supplied reason="omitted" resp="FinJon">
    ....
    </supplied>
#+END_SRC

#+BEGIN_SRC orgmode
    | su | b | 15 |  | omitted | FinJon | | | | | | | | | | | |
    ....
    | su | e | 15 |  |         |        | | | | | | | | | | | | 
#+END_SRC

The first field of both the beginning and end line is occupied by the
type designation, i.e. =ad= for =<add>=, =de= for =<del>=, =su= for
=<supplied>=, =uc= for =<unclear>=, =sd= for =<me:suppressed>=,
=<surplus>= (as well as the older element =<me:expunged>=), =q= for
=<quote>=, =<q>= and =fw= for =<fw>=.

The second field contains either =b= to mark a beginning line or =e= for
the end. If the markup in question occurs within a word, this field
takes =X=.

The third field holds an internal counter, giving the position of the
element in question in =<body>= (only counting elements of the same name
as self). This internal counter is repeated in the end line.

The fourth field of a beginning line reads in the value of any present
=@type= attribute. The end line does not repeat this information.

The fifth field of a beginning line reads in the value of any present
=@reason= attribute. The end line does not repeat this information.

The sixth field of a beginning line reads in the value of any present
=@resp= attribute. The end line does not repeat this information.

The seventh field of a beginning line reads in the value of any present
=@hand= attribute. The end line does not repeat this information.

The eighth field of a beginning line reads in the value of any present
=@rend= attribute. The end line does not repeat this information.

The ninth field of a beginning line reads in the value of any present
=@place= attribute. The end line does not repeat this information.

The ninth field of a beginning line reads in the value of any present
=@agent= attribute. The end line does not repeat this information.

The ninth field of a beginning line reads in the value of any present
=@source= attribute. The end line does not repeat this information.

The remaining fields are currently left empty.


