documentation/Documentation-for-xslt-import.html

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Divisions, heads, segments, paragraphs, line groups and verse lines</h3>
<div class="outline-text-3" id="text-2-5">
<p>
The structural elements <code>&lt;div&gt;</code>, <code>&lt;head&gt;</code>, <code>&lt;seg&gt;</code>, <code>&lt;p&gt;</code>, <code>&lt;lg&gt;</code> and
<code>&lt;l&gt;</code> are transformed into beginning and ending lines surrounding the
transcribed text (similar to the markup for names) as shown in the example.
</p>

<div class="org-src-container">
<label class="org-src-name">Example of <code>&lt;div&gt;</code> in XML input</label>
<pre class="src src-xml">&lt;<span style="color: #edd400; font-weight: bold;">div</span> <span style="color: #ff6347;">n</span>=<span style="color: #ad7fa8; font-style: italic;">"2.2"</span> <span style="color: #ff6347;">type</span>=<span style="color: #ad7fa8; font-style: italic;">"chapter"</span> <span style="color: #ff6347;">subtype</span>=<span style="color: #ad7fa8; font-style: italic;">"subchapter"</span>&gt;
....
&lt;/<span style="color: #edd400; font-weight: bold;">div</span>&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-orgmode">| d | b | 3 | 2.2 | chapter | subchapter | | | | | | | | | | | |
....
| d | e | 3 |     |         |            | | | | | | | | | | | |
</pre>
</div>

<p>
The first field is occupied by the type designation, i.e. <code>d</code> for
<code>&lt;div&gt;</code>, <code>h</code> for <code>&lt;head&gt;</code>, <code>s</code> for <code>&lt;seg&gt;</code>, <code>pa</code> for <code>&lt;p&gt;</code>, <code>lg</code> for
<code>&lt;lg&gt;</code> and <code>l</code> for <code>&lt;l&gt;</code>.
</p>

<p>
The second field contains either <code>b</code> to mark a beginning line or <code>e</code> for
the end.
</p>

<p>
The third field holds an internal counter, giving the position of the
element in question in <code>&lt;body&gt;</code> (only counting elements of the same name
as self). This internal counter is repeated in the ending line.
</p>

<p>
The fourth field of a beginning line reads in the value of any present
<code>@n</code> attribute. The end line does not repeat this information. For
<code>&lt;div&gt;</code> elements the value of <code>@n</code> is expected to agree with the <code>@n</code> of
the relevant <code>&lt;msItem&gt;</code> in the <code>&lt;msDesc&gt;</code> part of the header.
</p>

<p>
The fifth field of a beginning line reads in the value of any present
<code>@type</code> attribute. The end line does not repeat this information.
</p>

<p>
The sixth field of a beginning line reads in the value of any present
<code>@subtype</code> attribute. The end line does not repeat this information.
</p>

<p>
The seventh field of a beginning line reads in the value of any present
<code>@xml:id</code> attribute. The end line does not repeat this information.
</p>

<p>
The eighth field of a beginning line reads in the value of any present
<code>@rend</code> attribute. The end line does not repeat this information.
</p>

<p>
The ninth field of a beginning line reads in the value of any present <code>@met</code>
attribute (e.g. on <code>&lt;l&gt;</code>). The end line does not repeat this information.
</p>

<p>
The tenth field of a beginning line reads in the contents of the element
if it contains text that is not further marked up by means of <code>&lt;w&gt;</code>,
<code>&lt;pc&gt;</code> or <code>&lt;me:punct&gt;</code>. The end line does not repeat this information.
</p>

<p>
The remaining fields are currently left empty.
</p>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Additions, deletions, supplied, suppressed/surplus, unclear word, quotes and forme work</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Elements that mark editorial or scribal changes or emendation and are not
found within words in the XML but rather surrounding words are
transformed into beginning and end lines surrounding the transcribed
text (similar to the markup for names and structural markup). In
addition to that, the word forms in question receive additional
editorial mark-up on all transcriptional levels. If such elements occur
within words, they are converted to the relevant
editorial mark-up (see below) in addition to a single preceding line
that follows the structure of an opening line, but takes <code>X</code> in the 
second field.
</p>

<div class="org-src-container">
<label class="org-src-name">Example of <code>&lt;supplied&gt;</code> in XML input</label>
<pre class="src src-xml">&lt;<span style="color: #edd400; font-weight: bold;">supplied</span> <span style="color: #ff6347;">reason</span>=<span style="color: #ad7fa8; font-style: italic;">"omitted"</span> <span style="color: #ff6347;">resp</span>=<span style="color: #ad7fa8; font-style: italic;">"FinJon"</span>&gt;
....
&lt;/<span style="color: #edd400; font-weight: bold;">supplied</span>&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-orgmode">| su | b | 15 |  | omitted | FinJon | | | | | | | | | | | |
....
| su | e | 15 |  |         |        | | | | | | | | | | | | 
</pre>
</div>

<p>
The first field of both the beginning and end line is occupied by the
type designation, i.e. <code>ad</code> for <code>&lt;add&gt;</code>, <code>de</code> for <code>&lt;del&gt;</code>, <code>su</code> for
<code>&lt;supplied&gt;</code>, <code>uc</code> for <code>&lt;unclear&gt;</code>, <code>sd</code> for <code>&lt;me:suppressed&gt;</code>,
<code>&lt;surplus&gt;</code> (as well as the older element <code>&lt;me:expunged&gt;</code>), <code>q</code> for
<code>&lt;quote&gt;</code>, <code>&lt;q&gt;</code> and <code>fw</code> for <code>&lt;fw&gt;</code>.
</p>

<p>
The second field contains either <code>b</code> to mark a beginning line or <code>e</code> for
the end. If the markup in question occurs within a word, this field
takes <code>X</code>.
</p>

<p>
The third field holds an internal counter, giving the position of the
element in question in <code>&lt;body&gt;</code> (only counting elements of the same name
as self). This internal counter is repeated in the end line.
</p>

<p>
The fourth field of a beginning line reads in the value of any present
<code>@type</code> attribute. The end line does not repeat this information.
</p>

<p>
The fifth field of a beginning line reads in the value of any present
<code>@reason</code> attribute. The end line does not repeat this information.
</p>

<p>
The sixth field of a beginning line reads in the value of any present
<code>@resp</code> attribute. The end line does not repeat this information.
</p>

<p>
The seventh field of a beginning line reads in the value of any present
<code>@hand</code> attribute. The end line does not repeat this information.
</p>

<p>
The eighth field of a beginning line reads in the value of any present
<code>@rend</code> attribute. The end line does not repeat this information.
</p>

<p>
The ninth field of a beginning line reads in the value of any present
<code>@place</code> attribute. The end line does not repeat this information.
</p>

<p>
The ninth field of a beginning line reads in the value of any present
<code>@agent</code> attribute. The end line does not repeat this information.
</p>

<p>
The ninth field of a beginning line reads in the value of any present
<code>@source</code> attribute. The end line does not repeat this information.
</p>

<p>
The remaining fields are currently left empty.
</p>
</div>
</div>
